{"pages":[],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/05/11/hello-world/"},{"title":"Hexo를 이용해서 github.io blog 만들기","text":"Hexo를 이용해서 github.io blog 만들기 Hexo는 무엇인가요? (참조 https://hexo.io/ko/docs/) Hexo는 빠르고 간단하고 파워풀한 블로그 프레임워크입니다. Markdown(또는 다른 언어)을 사용하여 포스트를 작성하면 Hexo는 금세 멋진 테마를 가미해서 정적인 파일을 생성해 드립니다. 구름 사이트 접속 이후 계정을 생성한다. (참조 https://ide.goorm.io/?plan=ZnJlZQ== ) 새로운 컨테이너를 생성클릭한다. 이름, 설명을 등록하고 소프트웨어 스택은 Node.js를 선택한다. 컨테이서 생성을 클릭한다. 새로운 컨테이너가 생성되면 새로운 구름IDE의 페이지가 실행된다. 구름IDE의 좌측은 폴더가 아랫쪽은 터미널이 실행된다. 구름IDE의 터미널에 Hexo를 설치하기 위해서 아래의 명령을 실행한다. -g global 1npm install hexo-cli -g Hexo를 초기화한다. hexoblog는 구름IDE의 좌측에 생성되는 폴더이름이다. 1hexo init hexoblog 현재 디렉토리 확인 이후 4번에서 생성한 폴더로 이동한다. 1234root@goorm:/workspace/blog# pwd/workspace/blogroot@goorm:/workspace/blog# cd hexoblog/root@goorm:/workspace/blog/hexoblog# 터미널에 npm install을 명령어를 실행한다. 1npm install themes를 설치한다. (참고 https://github.com/ppoffice/hexo-theme-icarus) 구름IDE의 터미널에 “.git”를 삭제하고 hexo-theme-icarus도 hexoblog로 변경했다. clonenpm install ``` 128. 좌측 폴더에서 hexoblog/themes/_config.yml의 파일을 열고 Extension으로 이동해서 theme의 landscape를 hexoblog로 변경한다. theme: hexoblog 129. hexo server의 port를 open한다. port 확인은 프로젝트 -&gt; 실행 URL과 포트에서 확인 가능 root@goorm:/workspace/blog/hexoblog/themes# hexo server -p 3000 ```","link":"/2020/05/11/blog/"},{"title":"github pages 활용하기","text":"새로운 Repositories를 생성한다. Repositories의 이름은 URL을 생성하는 기준이다. 사용자ID.github.io를 추천한다. (참조 csbcp.github.io) github의 url을 복사하고 _config.yml의 # Deployment로 이동한다. type, repo, branch를 등록한다. 1234deploy: type: git repo: https://github.com/csbcp/csbcp.github.io branch: master github에 deploy 이전에 필요한 패키지를 설치한다. 1npm install hexo-deployer-git --save github에 파일을 올릴때에는 정적파일 형태로 deploy를 해야하므로 generate를 실행한다. 1hexo generate deploy에 필요한 정보를 설정한다. 123git config --global user.email &quot;charles&quot; global user.name &quot;charles&quot; git config --global user.email &quot;charles@uangel.com&quot; github에 deploy 한다. 1root@goorm:/workspace/blog/hexoblog/themes# hexo deploy","link":"/2020/05/11/hexo-using/"},{"title":"jasper-studio","text":"title: “Jasper Studio 메뉴얼 (v0.1)”date: 2020-05-11 07:15:24tags: Jasper Studio1. Jasper Studio 설치JasperSoft 사이트에 접속해서 파일을 다운로드한다. 12$ 기본 설정 방법JasperSoft Download (https://community.jaspersoft.com/project/jaspersoft-studio/releases) 2. Oracle 설정JasperSoft의 좌측메뉴에서 Data Adapters의 마우스 오른쪽을 클릭해서 Create Data Adapters를 클릭한다. Database JDBC Connect을 선택하고 Next를 클릭한다. Oracle 접속정보를 등록한다. JDBC Url, Username, Password는 접속하는 사이트에 맞게 설정하고 하단에 Test를 클릭한다. 123456$ 오라클 기본 설정 정보Name:Charles DBJDBC Driver:oracle.jdbc.driver.OracleDriverJDBC Url:jdbc:oracle:thin:@//127.0.0.1:1521/CharlesUsername:charlesPassword:xxxxxx Data Adapter Wizard 하단의 Driver Classpath로 이동하고 Add를 클릭해서 Oracle JDBC Driver 파일의 위치를 설정한다. Oracle JDBC Driver Download Successful 팝업 메시지가 보이면 Finish를 클릭해서 DB 접속을 마무리한다. 3. Server 접속 정보 설정JasperSoft의 좌측메뉴에서 Servers의 마우스 오른쪽을 클릭해서 Create JasperReports Server Connection를 클릭한다. JasperReports Server 접속정보를 등록한다. Name, URL, User, Password는 접속하는 서버의 정보를 입력하고 하단에 Test를 클릭한다. 12345$ JasperReports Server 기본 설정 정보Name:JasperReports Server ProURL:http://localhost:8080/jasperserver-pro/Username:charlesPassword:xxxxxx Successful 팝업 메시지가 보이면 Finish를 클릭해서 jasperReports Server 설정을 마무리한다. 4. Repository 생성Source를 저장 할 폴더를 생성한다. 프로젝트를 수행하는 경우 소스 관리를 위해서 git에 Repositories를 생성해서 진행하는것을 권고한다. 123$ Source 폴더 생성$ git에 Repositories 생성$ Source 폴더에서 git clone 수행 Source Import 진행 1234JasperSoft -&gt; File -&gt; Import 클릭General -&gt; Existing Project into Workspace 선택 이후 Next 클릭Browe..를 클릭해서 생성한 Source 폴더 연결Finish 클릭","link":"/2020/05/12/jasper-studio/"},{"title":"jasper-invoice","text":"title: jasper-coffeedate: 2020-05-12 07:23:53tags: Jasper Report Jasper Report 실습JasperSoft studio를 이용해서 간단한 샘플 보고서를 만든다. 12$ file -&gt; new -&gt; jasper report -&gt; Invoice를 선택 이후 next 클릭$ 새로운 보고서를 저장할 폴더 및 파일 이름 입력 이후 next 클릭 보고서는 기본적으로 Title, Column Header, Detail 1, Last Page Footer의 Band로 구성된다. 1234$ Title : 보고서의 첫페이지에 출력되는 밴드이다. (예:회사이름, 회사주소, 출력일자, etc)$ Column Header : Detail 1에 표시되는 데이터의 이름을 밴드이다. (예:고객명, 고객정보, 고객주소, etc)$ Detail 1 : 데이터를 출력하는 밴드이다. (예: 철수, 남자, 대한민군, etc)$ Last Page Footer : 보고서의 가장 마지막에 출력되는 밴드이다. (예: 안내문고, 보고서페이지, etc) 기본적인 Title 구성 한 후 보고서에 출력할 데이터를 DB에서 추출한다. 123$ 우측에 Dataset_and_Query_Dialog 아이콘을 클릭한다.$ 데이터를 추출한 SQL Query를 작성한다. $ 별도의 SQL Tool을 이용하여 1차 Query에 대한 검증을 완료하고 진행하는것을 추천한다. Dataset and Query Diaglog를 이용하여 데이터 추출하기 12345$ 1. 접속할 DB를 선택한다.$ 2. SQL Query를 작성한다.$ 3. Read Fields 버튼을 클릭한다.$ 4. 불필요한 필드를 삭제하고 순서를 조정한다.$ 5. Parameters 탭을 클릭한다","link":"/2020/05/13/jasper-invoice/"}],"tags":[],"categories":[]}